[
    {
        "Id": 1,
        "destination": "Agra",
        "description": "Home to the Taj Mahal, one of the Seven Wonders of the World.",
        "details": "Taj Mahal, Agra Fort, Fatehpur Sikri, Mehtab Bagh, Itimad-ud-Daulah's Tomb",
        "metadata": "{type:city}"
    },
    {
        "Id": 2,
        "destination": "Jaipur",
        "description": "The Pink City, known for its royal palaces and vibrant markets.",
        "details": "Hawa Mahal, Amber Fort, City Palace, Jantar Mantar, Nahargarh Fort",
        "metadata": "{type:city}"
    },
    {
        "Id": 3,
        "destination": "Tokyo",
        "description": "A vibrant metropolis blending ultramodern and traditional culture.",
        "details": "Shinjuku, Tokyo Tower, Meiji Shrine, Shibuya Crossing, Senso-ji Temple",
        "metadata": "{type:city}"
    },
    {
        "Id": 4,
        "destination": "Paris",
        "description": "The City of Light, known for its art, fashion, and gastronomy.",
        "details": "Eiffel Tower, Louvre Museum, Notre-Dame Cathedral, Montmartre, Champs-Élysées",
        "metadata": "{type:city}"
    },
    {
        "Id": 5,
        "destination": "Cairo",
        "description": "Ancient city home to the Great Pyramids and the Sphinx.",
        "details": "Pyramids of Giza, Egyptian Museum, Khan el-Khalili, Coptic Cairo, Saladin Citadel",
        "metadata": "{type:city}"
    },
    {
        "Id": 6,
        "destination": "Rome",
        "description": "The Eternal City, rich in history and culture.",
        "details": "Colosseum, Vatican City, Pantheon, Trevi Fountain, Roman Forum",
        "metadata": "{type:city}"
    },
    {
        "Id": 7,
        "destination": "New York",
        "description": "The city that never sleeps, known for its skyline and Broadway.",
        "details": "Statue of Liberty, Times Square, Central Park, Empire State Building, Broadway",
        "metadata": "{type:city}"
    },
    {
        "Id": 8,
        "destination": "Sydney",
        "description": "Harbor city famous for its Opera House and Bondi Beach.",
        "details": "Sydney Opera House, Bondi Beach, Harbour Bridge, Taronga Zoo, Darling Harbour",
        "metadata": "{type:city}"
    },
    {
        "Id": 9,
        "destination": "Rio de Janeiro",
        "description": "Brazil's cultural capital, known for its beaches and carnival.",
        "details": "Christ the Redeemer, Copacabana Beach, Sugarloaf Mountain, Ipanema, Maracanã Stadium",
        "metadata": "{type:city}"
    },
    {
        "Id": 10,
        "destination": "Cape Town",
        "description": "A coastal city known for Table Mountain and its vibrant culture.",
        "details": "Table Mountain, Robben Island, Cape of Good Hope, Kirstenbosch Gardens, V&A Waterfront",
        "metadata": "{type:city}"
    },
    {
        "Id": 11,
        "destination": "London",
        "description": "A global city blending history and modernity.",
        "details": "Big Ben, Buckingham Palace, Tower of London, British Museum, Hyde Park",
        "metadata": "{type:city}"
    },
    {
        "Id": 12,
        "destination": "Istanbul",
        "description": "Where East meets West, famous for its rich history and architecture.",
        "details": "Hagia Sophia, Blue Mosque, Grand Bazaar, Topkapi Palace, Bosphorus Strait",
        "metadata": "{type:city}"
    },
    {
        "Id": 13,
        "destination": "Bangkok",
        "description": "The vibrant capital of Thailand, known for its street life and temples.",
        "details": "Grand Palace, Wat Arun, Chatuchak Market, Floating Markets, Khao San Road",
        "metadata": "{type:city}"
    },
    {
        "Id": 14,
        "destination": "Dubai",
        "description": "A futuristic city with the world's tallest building and luxury shopping.",
        "details": "Burj Khalifa, Palm Jumeirah, Dubai Mall, Burj Al Arab, Desert Safari",
        "metadata": "{type:city}"
    },
    {
        "Id": 15,
        "destination": "Barcelona",
        "description": "A Spanish city famous for Gaudí's architecture and Mediterranean beaches.",
        "details": "Sagrada Familia, Park Güell, La Rambla, Casa Batlló, Camp Nou",
        "metadata": "{type:city}"
    },
    {
        "Id": 16,
        "destination": "Berlin",
        "description": "Germany’s capital, known for its history and vibrant culture.",
        "details": "Brandenburg Gate, Berlin Wall, Reichstag, Museum Island, Alexanderplatz",
        "metadata": "{type:city}"
    },
    {
        "Id": 17,
        "destination": "Moscow",
        "description": "Russia’s capital, home to historic and architectural marvels.",
        "details": "Red Square, Kremlin, Saint Basil’s Cathedral, GUM, Bolshoi Theatre",
        "metadata": "{type:city}"
    },
    {
        "Id": 18,
        "destination": "Toronto",
        "description": "Canada’s largest city, known for its skyline and multicultural vibe.",
        "details": "CN Tower, Royal Ontario Museum, Distillery District, Ripley's Aquarium, St. Lawrence Market",
        "metadata": "{type:city}"
    },
    {
        "Id": 19,
        "destination": "Beijing",
        "description": "China’s capital, rich in history and culture.",
        "details": "Great Wall, Forbidden City, Temple of Heaven, Summer Palace, Tiananmen Square",
        "metadata": "{type:city}"
    },
    {
        "Id": 20,
        "destination": "Singapore",
        "description": "A modern city-state famous for its innovation and green spaces.",
        "details": "Marina Bay Sands, Gardens by the Bay, Sentosa Island, Merlion Park, Chinatown",
        "metadata": "{type:city}"
    },
    {
        "Id": 21,
        "destination": "Buenos Aires",
        "description": "Argentina’s capital, known for tango and European-style architecture.",
        "details": "La Boca, Recoleta Cemetery, Plaza de Mayo, Palermo, Teatro Colón",
        "metadata": "{type:city}"
    },
    {
        "Id": 22,
        "destination": "Venice",
        "description": "The Floating City, known for its canals and romantic charm.",
        "details": "Grand Canal, St. Mark's Basilica, Rialto Bridge, Doge's Palace, Murano Island",
        "metadata": "{type:city}"
    },
    {
        "Id": 23,
        "destination": "Athens",
        "description": "The cradle of Western civilization and home to ancient wonders.",
        "details": "Acropolis, Parthenon, Plaka, Ancient Agora, National Archaeological Museum",
        "metadata": "{type:city}"
    },
    {
        "Id": 24,
        "destination": "Los Angeles",
        "description": "Entertainment capital, home to Hollywood and sunny beaches.",
        "details": "Hollywood Walk of Fame, Griffith Observatory, Santa Monica Pier, Universal Studios, Venice Beach",
        "metadata": "{type:city}"
    }
]